SvOlli/sorbus/src/rp2040/jam/bus.c
/**
 * Copyright (c) 2023 Sven Oliver "SvOlli" Moll
 *
 * SPDX-License-Identifier: GPL-3.0-or-later
 *
 * This program implements a JAM (Just Another Machine) custom platform
 * for the Sorbus Computer
 */

#include <ctype.h>
#include <malloc.h>
#include <time.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "rp2040_purple.h"

#include <pico/binary_info.h>
#include <pico/multicore.h>
#include <pico/platform.h>
#include <pico/rand.h>
#include <pico/stdlib.h>
#include <pico/util/queue.h>

#include <hardware/clocks.h>

#include "jam.h"

#include "bus.h"

#include "event_queue.h"
#include "dhara_flash.h"
#include "dhara/error.h"

#include "cpu_detect.h"
#include "disassemble.h"

// this is where the write protected area starts
#define ROM_START (0xE000)
// this is where the kernel is in raw flash
#define FLASH_KERNEL_START (FLASH_KERNEL_START_TXT)

// setup data for binary_info
#define FLASH_DRIVE_INFO  "fs image at " __XSTRING(FLASH_DRIVE_START_TXT)
bi_decl(bi_program_feature(FLASH_DRIVE_INFO))
#define FLASH_KERNEL_INFO "kernel   at " __XSTRING(FLASH_KERNEL_START_TXT)
bi_decl(bi_program_feature(FLASH_KERNEL_INFO))

uint8_t ram[0x10000] = { 0 }; // 64k of RAM and I/O
uint8_t rom[FLASH_DRIVE_START_TXT-FLASH_KERNEL_START_TXT]; // buffer for roms
const uint8_t *romvec;        // pointer into current ROM/RAM bank at $E000
uint32_t state;
uint32_t address;

// measure time used for processing one million clock cycles (mcc)
uint64_t time_per_mcc          = 1; // in case a division is done

// no need to volatile these, as they are only used within bus_run loop
uint32_t timer_irq_total       = 0;
uint32_t timer_nmi_total       = 0;

bool nmi_timer_triggered       = false;
bool irq_timer_triggered       = false;
bool cpu_running               = false;
bool cpu_running_request       = true;

// number of states should be power of 2
#define BUSLOG_SIZE (512)
#if (BUSLOG_SIZE & (BUSLOG_SIZE-1))
#error BUSLOG_SIZE is not a power of 2
#endif
uint32_t buslog_states[BUSLOG_SIZE] = { 0 };
uint     buslog_index               = 0;
uint32_t watchdog_cycles_total      = 0;

uint16_t dhara_flash_size = 0;
#define DHARA_SYNC_DELAY (100000)

// identification
const uint8_t sorbus_id[] = { 'S', 'B', 'C', '2', '3', 1, 1, 0 };
const uint8_t *sorbus_id_p;
cputype_t cputype = CPU_UNDEF;
const static uint8_t cpufeatures[] =
{
   0x00, // CPU_ERROR
   0x01, // CPU_6502:   NMOS
   0x06, // CPU_65C02:  CMOS | bit set/reset/branch
   0x12, // CPU_65816:  CMOS | 16 bit
   0x0e, // CPU_65CE02: CMOS | bit set/reset/branch | z-register
   0x21, // CPU_6502RA: NMOS without ROR
   0x02, // CPU_65SC02: CMOS
   0x00  // CPU_UNDEF
};

// magic addresses that cannot be addressed otherwise
#define MEM_ADDR_UART_CONTROL (0xDF0B)
#define MEM_ADDR_ID_LBA       (0xDF70)
#define MEM_ADDR_ID_MEM       (0xDF72)

/******************************************************************************
 * internal functions
 ******************************************************************************/


static inline void bus_data_write( uint8_t data )
{
   gpio_put_masked( bus_config.mask_data, ((uint32_t)data) << bus_config.shift_data );
}


static inline uint8_t bus_data_read()
{
   return (gpio_get_all() >> bus_config.shift_data);
}


void check_cpu_is_halted()
{
   while(gpio_get_all() & bus_config.mask_rdy)
   {
      printf( "\rinternal error: cpu should be stopped." );
   }
}


void set_bank( uint8_t bank )
{
   // rom banks are counted starting with 1, as 0 is RAM
   if( bank > (sizeof(rom) / 0x2000) )
   {
      bank = 1;
   }
   if( bank == 0 )
   {
      romvec = &ram[0xE000];
   }
   else
   {
      // if there are too many banks, the data could be copied from flash
      // to a single 8K RAM buffer during each bankswitch
      romvec = &rom[(bank - 1) * 0x2000];
   }
}


void system_trap( int type )
{
   // when stopped don't create more traps
   if( !(state & bus_config.mask_rdy) )
   {
      return;
   }

   // notify core 0 to take over
   if( queue_try_add( &queue_uart_write, &type ) )
   {
      // stop the CPU as soon as possible
      gpio_clr_mask( bus_config.mask_rdy );
   }
}


static inline uint8_t get_memory( uint16_t addr )
{
   if( addr < ROM_START )
   {
      return ram[addr];
   }
   else
   {
      return romvec[addr & 0x1FFF];
   }
}


static inline void handle_ramrom()
{
   if( state & bus_config.mask_rw )
   {
      // read from memory and write to bus
#if 0
      // this is nicer
      bus_data_write( get_memory( address ) );
#else
      // this is faster
      if( address < ROM_START )
      {
         bus_data_write( ram[address] );
      }
      else
      {
         bus_data_write( romvec[address & 0x1FFF] );
      }
#endif
   }
   else
   {
      // always write to RAM
      ram[address] = bus_data_read();
   }
}


static inline void event_estimate_cpufreq( __unused void *data )
{
   // event handler for estimating the 65C02 CPU speed
   // this event is exactly 1 time in queue

   static uint64_t time_last = 0;
   uint64_t time_now = time_us_64();

   if( state & bus_config.mask_rdy )
   {
      // only count time when CPU is not halted
      time_per_mcc = time_now - time_last;
   }
   time_last = time_now;

   queue_event_add( 1000000, event_estimate_cpufreq, 0 );
}


static inline void event_watchdog( __unused void *data )
{
   // event handler for watchdog timer
   // this event is max 1 time in queue

   system_trap( SYSTEM_WATCHDOG );
}


static inline void watchdog_setup( uint8_t value, uint8_t config )
{
   config &= 0x03;
   if( config )
   {
      if( queue_event_contains( event_watchdog ) )
      {
         // timer is running: restart
         queue_event_cancel( event_watchdog );
         queue_event_add( watchdog_cycles_total, event_watchdog, 0 );
      }
      else
      {
         // not running, set 24 bit value
         watchdog_cycles_total &= ~(0xFF << ((config-1) * 8));
         watchdog_cycles_total |= (value << ((config-1) * 8));
         if( config == 3 )
         {
            // start watchdog
            queue_event_add( watchdog_cycles_total, event_watchdog, 0 );
         }
      }
   }
   else
   {
      // stop watchdog
      queue_event_cancel( event_watchdog );
      watchdog_cycles_total = 0;
   }
}


