SvOlli/sorbus/src/rp2040/jam/bus.c
static inline uint32_t getaddr( uint32_t _state )
{
   return (_state & bus_config.mask_address) >> (bus_config.shift_address);
}


static inline uint32_t getdata( uint32_t _state )
{
   return (_state & bus_config.mask_data) >> (bus_config.shift_data);
}


uint32_t debug_getbus( int i )
{
   uint32_t state = buslog_states[(i + buslog_index) & (BUSLOG_SIZE-1)];
   uint32_t prev2 = buslog_states[(i + buslog_index - 2) & (BUSLOG_SIZE-1)];
   uint32_t prev  = buslog_states[(i + buslog_index - 1) & (BUSLOG_SIZE-1)];
   uint32_t next  = buslog_states[(i + buslog_index + 1) & (BUSLOG_SIZE-1)];

   bool has_follow = ((getaddr( state ) + 1) == getaddr( next ));
   bool is_read = (state & bus_config.mask_rw) && (next & bus_config.mask_rw);
   bool is_follow = ((getaddr( prev ) + 1) == getaddr( state ));
   bool is_rts_stack = (getdata( prev2 ) == 0x60 );
   if( is_read && has_follow && !is_follow && !is_rts_stack )
   {
      state |= 0x80000000;
   }
   return state;
}



void debug_raw_backtrace()
{
   printf( "TRACE_START %s\n", cputype_name( cputype ) );
   for( int i = buslog_index; i < (buslog_index + BUSLOG_SIZE); ++i )
   {
      printf( "%08x\n", buslog_states[i & (BUSLOG_SIZE-1)] );
   }
   printf( "TRACE_END\n" );
}


void debug_backtrace()
{
   check_cpu_is_halted();

   printf( "historian:\n" );

   disass_show( DISASS_SHOW_NOTHING );
   disass_historian_t d = disass_historian_init( cputype ? cputype : CPU_6502,
                                                 &buslog_states[0],
                                                 BUSLOG_SIZE,
                                                 buslog_index & (BUSLOG_SIZE)-1 );
   for( int i = 0; i < BUSLOG_SIZE; ++i )
   {
      int index = (i+buslog_index) & (BUSLOG_SIZE-1);
      if( !disass_historian_entry( d, index ) )
      {
         break;
      }
      printf( "%3d:%s:%s\n", BUSLOG_SIZE-i,
              decode_trace( buslog_states[index], false, 0 ),
              disass_historian_entry( d, index ) );
   }
   disass_historian_done( d );
}


int32_t get_16bit_address( uint16_t lastaddr )
{
   uint16_t addr = 0;
   int count = 0;

   for(;;)
   {
      int c = getchar();
      if( (c >= '0') && (c <= '9') )
      {
         putchar( c );
         addr = (addr << 4) | (c & 0x0f);
         if( ++count >= 4 )
         {
            return addr;
         }
      }
      else if( ((c >= 'a') && (c <= 'f')) || ((c >= 'A') && (c <= 'F')) )
      {
         putchar( toupper(c) );
         c = toupper(c) - 'A' + 10;
         addr = (addr << 4) | (c & 0x0f);
         if( ++count >= 4 )
         {
            return addr;
         }
      }
      else switch( c )
      {
         case 'q':
         case 0x1b: // ESC
         case 0x1d: // CTRL+]
            puts( "quit" );
            return (-1);
         case ' ':
            while( count > 0 )
            {
               printf( "\b \b" );
               --count;
            }
            // slip through
         case 0x0d:
            if( !count )
            {
               addr = lastaddr;
               printf( "%04X", addr );
            }
            return addr;
            break;
         case 0x08:
         case 0x7f:
            if( count >= 0 )
            {
               printf( "\b \b" );
               addr >>= 4;
               --count;
            }
            break;
         default:
            break;
      }
   }
}


void debug_memorydump()
{
   const uint16_t show_size = 0x100;
   static uint16_t lastaddr = 0x0400;

   check_cpu_is_halted();

   for(;;)
   {
      printf( "%s mem ($%04X): ", cputype_name( cputype ), lastaddr );
      int32_t addr = get_16bit_address( lastaddr );
      printf( "\n" );
      if( addr < 0 )
      {
         lastaddr -= show_size;
         return;
      }
      // TODO: switch this somehow to get_memory()
      hexdump( get_memory, addr, show_size );
      lastaddr = addr + show_size;
   }
}


void debug_disassembler()
{
   static uint16_t lastaddr = 0x0400;
   uint16_t addr = 0;
   int count = 0;

   check_cpu_is_halted();

   for(;;)
   {
      printf( "%s disass ($%04X): ", cputype_name( cputype ), lastaddr );
      int32_t getaddr = get_16bit_address( lastaddr );
      printf( "\n" );
      if( getaddr < 0 )
      {
         return;
      }

      addr = (uint16_t)(getaddr & 0xFFFF);
      for( count = 0; count < 16; ++count )
      {
         disass_show( DISASS_SHOW_ADDRESS | DISASS_SHOW_HEXDUMP );
         puts( disass( addr, get_memory(addr), get_memory(addr+1), get_memory(addr+2), get_memory(addr+3) ) );
         //printf( "%s ; %d\n",
         //   disass( addr, get_memory(addr), get_memory(addr+1), get_memory(addr+2), get_memory(addr+3) ),
         //   disass_bytes( get_memory(addr) );
         addr += disass_bytes( get_memory(addr) );
      }
      lastaddr = addr;
   }
}


const char* debug_handler_name( queue_event_handler_t h )
{
   if( h == event_clear_reset )
   {
      return "event_clear_reset";
   }
   if( h == event_estimate_cpufreq )
   {
      return "event_estimate_cpufreq";
   }
   if( h == event_flash_sync )
   {
      return "event_flash_sync";
   }
   if( h == event_timer_irq )
   {
      return "event_timer_irq";
   }
   if( h == event_timer_nmi )
   {
      return "event_timer_nmi";
   }
   if( h == event_watchdog )
   {
      return "event_watchdog";
   }
}


void debug_queue_event( const char *text )
{
   queue_event_t *event;
   int i = 0;
   printf( "%s: %016llx:%016llx\n", text, _queue_cycle_counter, _queue_next_timestamp );
   for( event = _queue_next_event; event; event = event->next )
   {
      printf( "%02d:%016llx:%p:%-24s:%08x\n",
              i++,
              event->timestamp,
              event->handler,
              debug_handler_name( event->handler ),
              event->data );
   }
   printf( "done.\n" );
}

void debug_clocks()
{
   char cpu_clk[] = "                     ";
   uint f_pll_sys  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_PLL_SYS_CLKSRC_PRIMARY);
   uint f_pll_usb  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_PLL_USB_CLKSRC_PRIMARY);
   uint f_rosc     = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_ROSC_CLKSRC);
   uint f_clk_sys  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_SYS);
   uint f_clk_peri = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_PERI);
   uint f_clk_usb  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_USB);
   uint f_clk_adc  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_ADC);
   uint f_clk_rtc  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_RTC);
   uint time_hz = (double)1000000.0 / ((double)(time_per_mcc) / CLOCKS_PER_SEC / 10000);

