SvOlli/sorbus/src/rp2040/jam/bus.c
   check_cpu_is_halted();

   cpu_clk[snprintf( &cpu_clk[0], sizeof(cpu_clk)-1, "%s CLK:", cputype_name( cputype ) )] = ' ';
   printf("\n");
   printf("PLL_SYS:             %3d.%03dMHz\n", f_pll_sys / 1000, f_pll_sys % 1000 );
   printf("PLL_USB:             %3d.%03dMHz\n", f_pll_usb / 1000, f_pll_usb % 1000 );
   printf("ROSC:                %3d.%03dMHz\n", f_rosc    / 1000, f_rosc    % 1000 );
   printf("CLK_SYS:             %3d.%03dMHz\n", f_clk_sys / 1000, f_clk_sys % 1000 );
   printf("CLK_PERI:            %3d.%03dMHz\n", f_clk_peri / 1000, f_clk_peri % 1000 );
   printf("CLK_USB:             %3d.%03dMHz\n", f_clk_usb / 1000, f_clk_usb % 1000 );
   printf("CLK_ADC:             %3d.%03dMHz\n", f_clk_adc / 1000, f_clk_adc % 1000 );
   printf("CLK_RTC:             %3d.%03dMHz\n", f_clk_rtc / 1000, f_clk_rtc % 1000 );
   printf("%s%3d.%06dMHz\n", cpu_clk, time_hz / 1000000, time_hz % 1000000 );
}


void debug_heap()
{
   extern char __StackLimit, __bss_end__;
   struct mallinfo m = mallinfo();

   uint32_t total_heap = &__StackLimit  - &__bss_end__;
   uint32_t free_heap = total_heap - m.uordblks;

   printf("\n");
   printf( "total heap: %08x (%d)\n", total_heap, total_heap );
   printf( "free  heap: %08x (%d)\n", free_heap,  free_heap );
}


void debug_internal_drive()
{
   dhara_flash_info_t dhara_info;
   uint8_t dhara_buffer[SECTOR_SIZE];
   uint16_t dhara_sector = 0;

   check_cpu_is_halted();

   dhara_flash_info( dhara_sector, &dhara_buffer[0], &dhara_info );
   uint64_t hw_size  = dhara_info.erase_cells * dhara_info.erase_size;
   uint64_t lba_size = dhara_info.sectors * dhara_info.sector_size;
   printf("\n");
   printf("dhara hw sector size:  %08x (%d)\n", dhara_info.erase_size, dhara_info.erase_size );
   printf("dhara hw num sectors:  %08x (%d)\n", dhara_info.erase_cells, dhara_info.erase_cells );
   printf("dhara hw size:         %.2fMB\n", (float)hw_size / (1024*1024) );
   printf("dhara page size:       %08x (%d)\n", dhara_info.page_size, dhara_info.page_size );
   printf("dhara pages:           %08x (%d)\n", dhara_info.pages, dhara_info.pages );
   printf("dhara lba sector size: %08x (%d)\n", dhara_info.sector_size, dhara_info.sector_size );
   printf("dhara lba num sectors: %08x (%d)\n", dhara_info.sectors, dhara_info.sectors );
   printf("dhara lba size:        %.2fMB\n", (float)lba_size / (1024*1024) );
   printf("dhara gc ratio         %08x (%d)\n", dhara_info.gc_ratio, dhara_info.gc_ratio );
   printf("dhara read status:     %d\n", dhara_info.read_status );
   printf("dhara read error:      %s\n", dhara_strerror( dhara_info.read_errcode ) );
#if 0
   printf("dhara read sector $%04x:\n", dhara_sector );

   hexdump_buffer( dhara_buffer, SECTOR_SIZE );
#else
   uint16_t *lba = (uint16_t*)&ram[MEM_ADDR_ID_LBA];
   uint16_t *mem = (uint16_t*)&ram[MEM_ADDR_ID_MEM];
   printf("dhara last used sector: $%04x\n", *lba );
   hexdump( get_memory, (*mem)-0x80, SECTOR_SIZE );
#endif
}


#if 0
void debug_sysconfig()
{
   printf( "UVBRK:%04X  ", *((uint16_t*)&ram[0xDF78]) );
   printf( "UVNMI:%04X  ", *((uint16_t*)&ram[0xDF7A]) );
   printf( "UVNBK:%04X  ", *((uint16_t*)&ram[0xDF7C]) );
   printf( "UVIRQ:%04X\n", *((uint16_t*)&ram[0xDF7E]) );
}
#endif


static inline void handle_io()
{
   static union {
      uint32_t value;
      uint8_t  reg[4];
   } shadow_cycle_count;

   uint8_t data = state >> bus_config.shift_data;
   bool success;

   if( state & bus_config.mask_rw )
   {
      // I/O read
      switch( address & 0xFF )
      {
         case 0x01: // Sorbus ID
            bus_data_write( *sorbus_id_p );
            if( *sorbus_id_p )
            {
               ++sorbus_id_p;
            }
            else
            {
               sorbus_id_p = sorbus_id;
            }
            break;
         case 0x02: // random
            bus_data_write( rand() & 0xFF );
            break;
         case 0x04: // CPU features
            bus_data_write( cpufeatures[cputype] );
            break;
         case 0x0C: // console UART read
            success = queue_try_remove( &queue_uart_read, &data );
            bus_data_write( success ? data : 0x00 );
            break;
         case 0x0D: // console UART read queue
            bus_data_write( queue_get_level( &queue_uart_read )  );
            break;
         case 0x0F: // console UART write queue
            bus_data_write( queue_get_level( &queue_uart_write )  );
            break;
         case 0x10: // is timer for IRQ running
         case 0x11:
         case 0x12:
         case 0x13: // fall throughs are intended
            bus_data_write( irq_timer_triggered ? 0x80 : 0x00 );
            irq_timer_triggered = false;
            gpio_set_mask( bus_config.mask_irq );
            break;
         case 0x14: // is timer for NMI running
         case 0x15:
         case 0x16:
         case 0x17: // fall throughs are intended
            bus_data_write( nmi_timer_triggered ? 0x80 : 0x00 );
            nmi_timer_triggered = false;
            gpio_set_mask( bus_config.mask_nmi );
            break;
         case 0x20: // is timer for watchdog running
         case 0x21:
         case 0x22:
         case 0x23: // fall throughs are intended
            bus_data_write( watchdog_cycles_total ? 0x80 : 0x00 );
            break;
         case 0x24: // for some reason doesn't work with 0x2C (?)
            shadow_cycle_count.value = (uint32_t)_queue_cycle_counter;
            // fall through
         case 0x25:
         case 0x26:
         case 0x27:
            bus_data_write( shadow_cycle_count.reg[address & 3] );
            break;
         /* 0x2C-0x2F used as RAM for BRK routine */
         default:
            // everything else is handled like RAM by design
            handle_ramrom();
            break;
      }
      ram[address] = bus_data_read(); /* untested: get data back from bus */
   }
   else
   {
      // I/O write
      data = bus_data_read();
      switch( address & 0xFF )
      {
         case 0x00: // set bankswitch register for $E000-$FFFF
            set_bank( bus_data_read() );
            handle_ramrom(); // make sure register is mirrored to RAM for read
            break;
         case 0x01: // DEBUG only!
            system_trap( SYSTEM_TRAP );
            break;
         case 0x03: // scratch-1k
            handle_scratch_mem( data );
            break;
         case 0x0B: // UART read: enable crlf conversion
            console_set_crlf( data & 1 );
            console_set_flowcontrol( data & 2 );
            handle_ramrom(); // make sure register is mirrored to RAM for read
            break;
         case 0x0E: // console UART write
            queue_try_add( &queue_uart_write, &data );
            break;
         case 0x10: // setup timer for IRQ or NMI
         case 0x11:
         case 0x12:
         case 0x13:
         case 0x14:
         case 0x15:
         case 0x16:
         case 0x17: // fall throughs are intended
            timer_setup( data, address & 0x07 );
            break;
         case 0x20: // setup timer for watchdog
         case 0x21:
         case 0x22:
         case 0x23: // fall throughs are intended
            watchdog_setup( data, address & 0x03 );
            break;
         /* 0x2C-0x2F used as RAM for BRK routine */
         case 0x74: // dma read from flash disk
         case 0x75: // dma write to flash disk
         case 0x77: // flash disk trim, no dma address used
            // access is strobe: written data does not matter
            handle_flash_dma();
            break;
         default:
            // everything else is handled like RAM by design
            handle_ramrom();
            break;
      }
   }
}

