SvOlli/sorbus/src/rp2040/jam/bus.c
/******************************************************************************
 * public functions
 ******************************************************************************/
void bus_run()
{
   bus_init();
   system_init();
   system_reboot();

   // when not running as speed test run main loop forever
   for(;;)
   {
      // check if internal events need processing
      queue_event_process();

      // LOW ACTIVE
      if( !(state & bus_config.mask_reset) )
      {
         system_reset();
      }

      // done: set clock to high
      gpio_set_mask( bus_config.mask_clock );

      // bus should be still valid from clock low
      state = gpio_get_all();

      // setup bus direction so I/O can settle
      if( state & bus_config.mask_rw )
      {
         // read from memory and write to bus
         gpio_set_dir_out_masked( bus_config.mask_data );
         // note to future self: check if there's a better way for
         // external i/o then to set the GPIOs to write for a brief time
      }
      else
      {
         // read from bus and write to memory write
         gpio_set_dir_in_masked( bus_config.mask_data );
      }

      address = ((state & bus_config.mask_address) >> bus_config.shift_address);

      // setup data
      if( (address & 0xFF00) == 0xDF00 )
      {
         // internal I/O
         handle_io();
      }
      else if( (address <= 0x0003) || ((address & 0xF000) == 0xD000) )
      {
         // external i/o: keep hands off the bus
         gpio_set_dir_in_masked( bus_config.mask_data );
      }
      else
      {
         handle_ramrom();
      }

      // log last states
      if( state & bus_config.mask_rdy )
      {
         // state is not valid on the data when RP2040 is writing
         buslog_states[buslog_index++ & (BUSLOG_SIZE-1)] = gpio_get_all();
      }

      // done: set clock to low
      gpio_clr_mask( bus_config.mask_clock );
   }
}


void system_init()
{
   cputype = cpu_detect( false );
retry:
   if( cputype == CPU_ERROR )
   {
      bool success;
      uint8_t data;
      printf( "  cpu could not be detected, retrying (SPACE for debug)\r" );
      success = queue_try_remove( &queue_uart_read, &data );
      if( success && (data == ' ') )
      {
         cputype = cpu_detect( true );
         printf( "power jumper set?\n" );
      }

      goto retry;
   }
   memset( &ram[0x0000], 0x00, sizeof(ram) );
   memcpy( &rom[0x0000], (const void*)FLASH_KERNEL_START, sizeof(rom) );
   srand( get_rand_32() );
   dhara_flash_size = dhara_flash_init();
   disass_cpu( cputype );
}


void system_reboot()
{
   // clear out cpu state log
   memset( &buslog_states[0], 0, sizeof(buslog_states) );

   // make sure that RDY line is high
   gpio_set_mask( bus_config.mask_rdy | bus_config.mask_irq | bus_config.mask_nmi );

   // pull reset line to system_reset gets executed
   gpio_clr_mask( bus_config.mask_reset );
}
